---
type: ExternallyTaggedGeometryValidation
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ExternallyTaggedGeometryValidation

`Autodesk.Revit.DB.ExternallyTaggedGeometryValidation` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsNonSolid | 2022 | `public static bool IsNonSolid ( GeometryObject geometry )` |
| Method | IsSolid | 2022 | `public static bool IsSolid ( GeometryObject geometry )` |
| Method | IsValidGeometry | 2022 | `[ ObsoleteAttribute ("This method is deprecated in Revit 2024 and may be removed in a later version of Revit. We suggest using validation methods provided by the Element which uses this geometry where available. For exam` |
| Method | LacksSubnodes | 2022 | `public static bool LacksSubnodes ( GeometryObject geometry )` |